package com.it.web.user.service

/**
 * Created by qinglans on 2018/2/25.
 */
class UacAuthList {

    public static List auths = [

            //订单----------------
            '显示订单菜单',

            '显示工作安排',
            '订单查询',
            '返工',
            '安排加工',
            '安排外协',

            '显示零件合版',
            '零件合版',

            '显示成品打包',
            '成品打包',

            //备料----------------
            '显示备料菜单',

            '显示开纸',
            '开纸',

            '显示CTP制版',
            'CTP制版',

            //生产----------------
            '显示生产菜单',
            '执行加工',
            '执行外协',

            //统计----------------
            '显示统计菜单',
            '普通统计',
            '特殊统计',

            //损失----------------
            '显示损失菜单',
            '罚单处理',
            '事故处理',
            '事故设置',

            //仓库----------------
            '显示仓库菜单',
            '仓库管理',

            //财务----------------
            '显示财务菜单',
            '订单价格修改',
            '收付款',

            //财务----------------
            '工作岗位管理',
            '客户资料管理',
            '供应商资料管理',
            '用户管理',
            '价格设置'


    ]

}
